{ 
	"embarrassingThings": [
    "When are you going to tell that girlfriend you talk about (but don't have) that you're gay?",
    "Is this your girlfriend, son?",
    "OwO whats this? *nyuzzwes youw buwge*",
    "My steam library only has hentai games.",
    "I only go outside to buy food and not die.",
    "I jack off to My Little Pony porn every night.",
    "I stayed up to 9:01 PM, but my bedtime is 9:00 PM. TAKE THAT MOM!",
    "I am sexually attracted to nail clippings.",
    "I am a gamer, therefore, I am better than you.",
    "Naruto and Dragon Ball Z are the two greatest animes in the universe. Change my mind.",
    "I have 8 fursuits, one for each day, and one for when another is being cleaned.",
    "I torrented Fortnite.",
    "I own a bad dragon toy.",
    "I go onto r/funny daily.",
    "My mom follows me on social media.",
    "I play PC games with a Steam Controller.",
    "I own a cum sock.",
    "I listen to the billboard top 100 every week.",
    "My parents gave me PS Move instead of the Wii for Christmas.",
    "I spend every bit of free time I have making shitty memes to hide my suicidal thoughts.",
    "I spent 2 hours learning how to make a new folder on my computer.",
    "I am part of the hacker group known as 4chan.",
    "I cried myself to sleep when I found out that my favorite chair had a dent in it.",
    "I've got a real pants shitting situation over here.",
    "I get legitimetly scared when I play five nights at freddy's.",
    "I constantly think about my Mom and my sexual feelings toward her.",
    "It took me a full day to beat the first level of Super Mario Bros.",
    "I'm such an incompetant father that I cant even play catch with my son.",
    "I genuinely like the nutshack.",
    "I am a fan of [political figure].",
    "I held my pee in for a whole hour during fantastic beasts and where to find them.",
    "Video gamers rock! Brofist!",
    "I legitimetly find Dad Bot funny.",
    "I have a 1 inch penis, erect.",
    "I respond with \"^\" to everything because I'm too dumb to have an original thought of my own.",
    "my favorite emote is :joy:",
    "I hate dad bot.",
    "I have a crush on the map from dora the explorer.",
    "I learned japanese to watch hentai.",
    "I couldn't teach my son how to ride a bike cause I can't ride one myself.",
    "I made a discord server where exactly 3 people joined, they where my alt accounts.",
    "I have a kink for Pajama's.",
    "I ran out of ideas.",
    "I set my favorite 3ds game to system settings because I thought I was being clever.",
    "I masturbate to some things that can't be public.",
    "I still wet the bed.",
    "I still play mario 64.",
    "I wanna fuck rowlet.",
    "I spam d!embarrass because I am very narcissistic and want to see my face on a bot.",
    "Does anyone here know how to download club penguin?",
    "Paul Blart: Mall Cop is my favorite movie.",
    "My dad works for minecraft dont fuck with me or he will hack you.",
    "I spent several weeks with no sleep making a shitty dad joke bot.",
    "I want to fuck litten.",
    "I have a crush on my chair.",
    "I set my status to invisible just to annoy my friends.",
    "I spent 48 hours working on a video to explain half a presses.",
    "delet this.",
    "I want to have sexual relations with a seal from pokemon.",
    "I want to die on a daily basis.",
    "I have toesucker in my Tinder bio.",
    "I once deep fried a vibrator.",
    "The last time I peed myself was a year ago.",
    "My porn collection is a stack of anatomy textbooks.",
    "The only time I ever go outside is for school.",
    "I go through 3 armpit towels everyday.",
    "The only girl I had a crush on was pinkalicious.",
    "I had to go through 1st grade more than once, 7 times to be exact.",
    "I still play Animal Crossing.",
    "Sans Undertale is my daddy.",
    "I still unironically have a crush on the Onceler.",
    "I have sexual fantasies about The Creator Of Homestuck, Andrew Hussie every night.",
    "I use Tumblr and I'm deeply in love with the Tumblr Staff.",
    "I jizz in my pants when I hear the word \"happiness\" because it has the sound \"penis\" at the end.",
    "I decided to taste the sweat in my armpit because I wondered if it tasted the same way it smelled.",
    "When no-one is looking, I twerk at myself in the mirror.",
    "I jack off in Goodwill changing stalls.",
    "I once peed in a coffee cup while in the middle of a video game marathon and I still drink coffee out of it.",
    "Hitler-chan is my favorite anime waifu.",
    "I'm too scared to meet real girls so I get my granny to show me her granddaughters.",
    "My Dad doesn't know I watch porn, I watch Hentai. Every time my Dad comes in, I just say I'm watching a cartoon.",
    "I'm jealous of people who look more attractive, so I mark their posts on tumblr as sexual to flag them down.",
    "I had sex with a cactus...",
    "Well I fucked up my sex life just cause I found a trap attractive.",
    "One time, I sneezed and my tampon shot out of me like a missile.",
    "One time when I was drunk, I offered to trade my best friend for Taco Bell.",
    "I use and throughly like airpods.",
    "Trollface is my favorite meme. PROBLEM?",
    "I had to practice French kissing with my cat for three years. Yeah he's still better at it than me...",
    "I watch hentai.",
    "If my octopus waifu were real, she'd be very disappointed in me.",
    "Do you no de wae???",
    "My grandma runs faster than me, and she's 95 with arthritis.",
    "Ur Dad gey LOLOLOLOL",
    "I was sitting on the toilet and my lips touched my dick on accident.",
    "I once masturbated to an extra thicc piece of wood.",
    "I have a crush on my siblings.",
    "I like to Google \"big clocks\" and sometimes I leave the L in clocks out on purpose ;)",
    "My dad taught me how to find gay hentai.",
    "My Mom encouraged my gayness, then she found out I was a girl.",
    "I'm attracted to overweight Italian plumbers because I want to be like Princess Peach.",
    "I have a secret fetish for toes.",
    "Earth Chan is my go-to waifu.",
    "For Halloween I was a syphilitic donkey.",
    "I thought Shrek 3 wasn't bad.",
    "I think Uganda Knuckles is a funny and relevent meme.",
    "I own a sonic body pillow and I kiss it every night before I go to sleep.",
    "I just became a slut to a cottonswab.",
    "OMG Veggietales! My favorite anime!",
    "I unironically watch Ali-A.",
    "I'm subscribed to Morgz and his family.",
    "I got my parents to buy me a Macbook for gaming",
    "yeah I post to r/dankmemes and r/dogelore",
    "I unironically use 69 in my usernames.",
    "I have a GameInformer subscription.",
    "Thanks for the gold kind stranger!",
    "Who's Brian and why is he in my head??!!",
    "My favorite anime is Boku no pico.",
    "I vomit over my girlfriend while she’s sleeping and clean it all up before she wakes up.",
    "I watch incest porn on my tablet while I cook lasagna and broccoli with chocolate covered pudding.",
    "I got Twitch affiliate by cleaning my room on stream.",
    "I use Discord Light Theme.",
    "I wonder what the Annoying Orange would taste like!",
    "I farted and it stinks!",
    "I am madly in love with the Uh Oh Stinky monkey!"
  ] 
}